Repository: AppliedRecognition/Ver-ID-UI-iOS
Catalog: VerIDUI/*.lproj/Localizable.strings
Languages: fr, vi

source: Turn your head in the direction of the arrow
fr: Veuillez tourner la tête en direction de la flèche
vi: Xoay đầu theo hướng mũi tên

source: Great. You are now registered.
fr: Excellent. Vous êtes maintenant inscrit.
vi: Tuyệt vời, đăng ký thành công

source: Great. You authenticated using your face.
fr: Excellent. Vous vous êtes authentifié avec votre visage.
vi: Tuyệt vời, đã xác thực khuôn mặt

source: Great. Session succeeded.
fr: Excellent. Session réussie.
vi: Tuyệt vời, nhận diện thành công

source: Registration failed
fr: Échec de l’enregistrement
vi: Đăng ký thất bại

source: Authentication failed
fr: Échec d’authentification
vi: Xác thực thất bại.Vui lòng tham khảo gợi ý để thực hiện lại.

source: Session failed
fr: Échec de la session
vi: Nhận diện thất bại

source: Faces not suitable for recognition
fr: Visages non appropriés pour la reconnaissance
vi: Không nhận diện được khuôn mặt

source: User not registered
fr: Utilisateur non inscrit
vi: Người dùng chưa đăng ký

# Bearing not registered for user
source: Bearing %1$@ not registered for user %2$@
fr: Position %1$@ non enregistrée pour l’utilisateur %2$@
vi: Góc nghiêng %1$@ chưa được đăng ký cho người dùng %2$@

source: Face not found
fr: Impossible de trouver le visage
vi: Không nhận diện được khuôn mặt

source: Unable to decode image
fr: Impossible de décoder l’image
vi: Không thể xử lý ảnh

source: Missing API secret
fr: API secrète manquante
vi: Thiếu thông tin API

source: Missing resources URL
fr: Ressources URL manquantes
vi: Thiếu URL tài nguyên

source: Unable to initialize resource loader
fr: Impossible de réinitialiser le chargeur de ressources
vi: Không thể tải dữ liệu ban đầu

# Please go to settings and enable camera in the settings for app.
source: Please go to settings and enable camera in the settings for %@.
fr: Veuillez aller aux paramètres et activer la caméra dans les paramètres pour %@.
vi: Xin vào phần cài đặt để mở chức năng camera cho %@.

source: Preparing face detection
fr: En cours de préparation de la détection de visages
vi: Đang nhận diện khuôn mặt

source: Align your face with the oval
fr: Alignez votre visage avec l’ovale
vi: Vui lòng di chuyển khuôn mặt vào khuôn viền.

source: Great, hold it
fr: Très bien, ne bougez plus
vi: Tuyệt vời, xin đừng dịch chuyển

source: Hold it
fr: Ne bougez plus
vi: Xin đừng dịch chuyển

source: Slowly turn to follow the arrow
fr: Tournez lentement pour suivre la flèche
vi: Di chuyển từ từ theo hướng mũi tên

source: You may have turned too far. Only turn in the requested direction until the oval turns green.
fr: Vous vous êtes peut-être trop tourné. Ne tournez que dans la direction indiquée jusqu’à ce que l’ovale devienne vert.
vi: Di chuyển mặt theo hướng dẫn đến khi khung hình chuyển màu xanh
