<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>files</key>
	<dict>
		<key>Headers/DetRecLib.h</key>
		<data>
		MjpEZSuHplYKX3ncqaIrarRuWfA=
		</data>
		<key>Headers/DetRecLibSettings.h</key>
		<data>
		zGMRMyx+gxA2gyAZLnKl+DsucBk=
		</data>
		<key>Headers/Errors.h</key>
		<data>
		cy7LL6FYQ0sRHX29/joSyxAvR2o=
		</data>
		<key>Headers/TrackingSession.h</key>
		<data>
		l5BiFkELJBCk3Qx5BKiLMLoMtHg=
		</data>
		<key>Headers/VerIDCore-Swift.h</key>
		<data>
		pPwrVIb/+pdp8twwwakkkJi2t/U=
		</data>
		<key>Headers/VerIDCore.h</key>
		<data>
		S6tAzaHmoliTPluTd/NaxGyCX4Q=
		</data>
		<key>Headers/VerIDFaceDetectionOptions.h</key>
		<data>
		c2ztxXhADW6+JmxbpR21OxQkSB8=
		</data>
		<key>Headers/VerIDFaceTemplateVersion.h</key>
		<data>
		WGX8L/hG2jmx7LEZ+08dBdneCiU=
		</data>
		<key>Headers/VerIDImageFormat.h</key>
		<data>
		UsaB78JuQkYXav0DKMDdjK2ko2Y=
		</data>
		<key>Headers/VerIDImageQualityDetection.h</key>
		<data>
		oPMPjlJ4z3NH7Hk9DcRzSzSt9ks=
		</data>
		<key>Headers/VerIDRecognizable.h</key>
		<data>
		hNEdh61rrvrZJ/KNMLJ62q+YQH0=
		</data>
		<key>Info.plist</key>
		<data>
		FTY8PvOrzWkKVbOrty9Hwyq8SOU=
		</data>
		<key>Modules/VerIDCore.swiftmodule/arm64-apple-ios.abi.json</key>
		<data>
		GAvBNdvtTVi6Qb/nmTHjoYeqHeI=
		</data>
		<key>Modules/VerIDCore.swiftmodule/arm64-apple-ios.private.swiftinterface</key>
		<data>
		PVYEuwxCvx7SVPXS0Ny7KkvC5c8=
		</data>
		<key>Modules/VerIDCore.swiftmodule/arm64-apple-ios.swiftdoc</key>
		<data>
		0n15a/onQVq8afwODMoOTYU2Jng=
		</data>
		<key>Modules/VerIDCore.swiftmodule/arm64-apple-ios.swiftinterface</key>
		<data>
		PVYEuwxCvx7SVPXS0Ny7KkvC5c8=
		</data>
		<key>Modules/VerIDCore.swiftmodule/arm64-apple-ios.swiftmodule</key>
		<data>
		lzj4jv0SDUcT4e8pIYrAmrUrKUA=
		</data>
		<key>Modules/module.modulemap</key>
		<data>
		O2Z+ffitU4xxZHNT/Ijcu5/edPo=
		</data>
		<key>MoirePatternDetection.mlmodelc/analytics/coremldata.bin</key>
		<data>
		oawqJyBfnKZLsKsePZWTp7BZIOs=
		</data>
		<key>MoirePatternDetection.mlmodelc/coremldata.bin</key>
		<data>
		7iasq0LPXdSFf7eykLbBFNQ2lzU=
		</data>
		<key>MoirePatternDetection.mlmodelc/metadata.json</key>
		<data>
		LRgRc7Idomt7rfgCwJglj32Nxn0=
		</data>
		<key>MoirePatternDetection.mlmodelc/model.espresso.net</key>
		<data>
		lNS+Qgis0nsLEpjTV+0vzBmG0sY=
		</data>
		<key>MoirePatternDetection.mlmodelc/model.espresso.shape</key>
		<data>
		e/X9T/O40rtj1xG6JR8jYOrPsBY=
		</data>
		<key>MoirePatternDetection.mlmodelc/model.espresso.weights</key>
		<data>
		UpOYhK5vd6q4kQkjn2b98oovvBo=
		</data>
		<key>MoirePatternDetection.mlmodelc/model/coremldata.bin</key>
		<data>
		yNfQ7w7t+oLS6hqlkoRbmm1LArc=
		</data>
		<key>MoirePatternDetection.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		tkgF5pxT7RlO+9uypQti9obolyA=
		</data>
		<key>Resources.plist</key>
		<data>
		zvIGvX1LAffbWle5VG4XPUJSUF0=
		</data>
		<key>SpoofDetector.mlmodelc/analytics/coremldata.bin</key>
		<data>
		GHCgLr242/tZsC4742ObMrEYRtI=
		</data>
		<key>SpoofDetector.mlmodelc/coremldata.bin</key>
		<data>
		Mm+VghqbmuPZ23DS2BVjh9oJZmw=
		</data>
		<key>SpoofDetector.mlmodelc/metadata.json</key>
		<data>
		QVo/lfCP6g0Qkpk3opGmNRYQyo0=
		</data>
		<key>SpoofDetector.mlmodelc/model0/analytics/coremldata.bin</key>
		<data>
		1S1UXR9Tcxq/sUw/URTN25j0N2g=
		</data>
		<key>SpoofDetector.mlmodelc/model0/coremldata.bin</key>
		<data>
		jGU24Zr12fU7j/SArLdn69K6NOE=
		</data>
		<key>SpoofDetector.mlmodelc/model0/model.espresso.net</key>
		<data>
		Kmdh3tPWOV/fFXG67ZJz1iy7KJM=
		</data>
		<key>SpoofDetector.mlmodelc/model0/model.espresso.shape</key>
		<data>
		SgiXtJPAD1evTlB8/MEo+Kv0hlo=
		</data>
		<key>SpoofDetector.mlmodelc/model0/model.espresso.weights</key>
		<data>
		QlbrQ1ugwdn0eJQusJwx4gehco0=
		</data>
		<key>SpoofDetector.mlmodelc/model0/model/coremldata.bin</key>
		<data>
		tGU7K8v0jbmLrWPOZkDsl7EBsZk=
		</data>
		<key>SpoofDetector.mlmodelc/model0/neural_network_optionals/coremldata.bin</key>
		<data>
		tkgF5pxT7RlO+9uypQti9obolyA=
		</data>
		<key>SpoofDetector.mlmodelc/model1/coremldata.bin</key>
		<data>
		7dadUoJdvuNN7hoQifQLdEttmfo=
		</data>
		<key>VerIDModel.momd/VerIDModel.mom</key>
		<data>
		Z80+QEmxtyqBe5Y3PcVmN2c2V/o=
		</data>
		<key>VerIDModel.momd/VerIDModel.omo</key>
		<data>
		YlcD655Cw2pNICy+fRkKK1klZQU=
		</data>
		<key>VerIDModel.momd/VersionInfo.plist</key>
		<data>
		ezAolVkgGBvNTTx9QWDyiPtRmwM=
		</data>
		<key>VerIDModels/.gitattributes</key>
		<data>
		8DVgYHcjXyl2tR5pdni2qG72ZKE=
		</data>
		<key>VerIDModels/RFB-320.bin</key>
		<data>
		ka45VsYrFBduIk0Jl7j2k/mRNhI=
		</data>
		<key>VerIDModels/RFB-320.nv</key>
		<data>
		T/ZMLKHIPpeGQ4E6f2u1BRPQiVY=
		</data>
		<key>VerIDModels/RFB-320.param</key>
		<data>
		NyccPk29sh5/4ZOee0b/iPyXjbo=
		</data>
		<key>VerIDModels/dlib_face_recognition_resnet_model_v1.dat</key>
		<data>
		aT7KVi7fnRq17HG+T+7xWGdB/qc=
		</data>
		<key>VerIDModels/facemask-20200720-dut23td+1700-251149%3000.nv</key>
		<data>
		VpVb/170iWkj/aJeueGVP+Z6/hQ=
		</data>
		<key>VerIDModels/facenet-20170512.nv</key>
		<data>
		7kk8ELSfZxLT+ZRpelidA+oNg6Q=
		</data>
		<key>VerIDModels/fhogcascade_face_frontal.dat</key>
		<data>
		8Z15+509g3JbrrBJNVUW8tyHEGg=
		</data>
		<key>VerIDModels/mmod_human_face_detector.dat</key>
		<data>
		t8GLA469R9qNdHz7aQIklCosSoo=
		</data>
		<key>VerIDModels/mobilefacenet-opt.bin</key>
		<data>
		hmKCpHjCRV+zni54jvoHcW7FnZE=
		</data>
		<key>VerIDModels/mobilefacenet-opt.param</key>
		<data>
		razilEV/Mrn6LNw6gpvGbViaB1U=
		</data>
		<key>VerIDModels/mobilefacenet-q12.nv</key>
		<data>
		RVVTEtD97zBBpLdX8mWKv3YCubo=
		</data>
		<key>VerIDModels/rec21-recfull-20211108vw-fn23i-s8597c-b144f6-c1062-t100m10-r14s3000-q06.nv</key>
		<data>
		aSwHpz0njROp/10m5ttMqGKYddI=
		</data>
		<key>VerIDModels/shape_predictor_5_face_landmarks.dat</key>
		<data>
		7e7kPG/ObkyFXMY2rWEC8FKxWUk=
		</data>
		<key>VerIDModels/shape_predictor_68_face_landmarks.dat</key>
		<data>
		U20wf9KHcKk5RRWidU7gpiO0UdE=
		</data>
	</dict>
	<key>files2</key>
	<dict>
		<key>Headers/DetRecLib.h</key>
		<dict>
			<key>hash2</key>
			<data>
			yxwfzTWfSskaKo9mekOgBmazIs5RQb5N6S5S9PrwHzU=
			</data>
		</dict>
		<key>Headers/DetRecLibSettings.h</key>
		<dict>
			<key>hash2</key>
			<data>
			sHmuJeuNJmCdrcmHLwXJrDOkt3iyylw64CZq3+CZV3E=
			</data>
		</dict>
		<key>Headers/Errors.h</key>
		<dict>
			<key>hash2</key>
			<data>
			DDL5guN39tMTLQ6YdmF6SpJ6A7wI7y5mJjhbeeph+3Y=
			</data>
		</dict>
		<key>Headers/TrackingSession.h</key>
		<dict>
			<key>hash2</key>
			<data>
			bT+vekFnKAfTDcCOoZ6y+MZF82aQRJ0eiEH4PLtVdTg=
			</data>
		</dict>
		<key>Headers/VerIDCore-Swift.h</key>
		<dict>
			<key>hash2</key>
			<data>
			WV+w3QejfxAXSG3DuzrhIy118DDX2ki5B6UlrboZgPc=
			</data>
		</dict>
		<key>Headers/VerIDCore.h</key>
		<dict>
			<key>hash2</key>
			<data>
			IJFTGYy8CiOtt0Qyo7bTe2glPKd+w2eXnRKjL38NZU8=
			</data>
		</dict>
		<key>Headers/VerIDFaceDetectionOptions.h</key>
		<dict>
			<key>hash2</key>
			<data>
			vVzuG64w1KJbjg0aEAGOqYtwyL1C9SIuOc826sVoh2c=
			</data>
		</dict>
		<key>Headers/VerIDFaceTemplateVersion.h</key>
		<dict>
			<key>hash2</key>
			<data>
			lanpUvdLUkIB1qD0v8K4MBs24O0nW7ISYO+55u1W060=
			</data>
		</dict>
		<key>Headers/VerIDImageFormat.h</key>
		<dict>
			<key>hash2</key>
			<data>
			sldbXJ2eSvdv/FYf6A3fxdofxf8alSPXZOK3qJvnJOc=
			</data>
		</dict>
		<key>Headers/VerIDImageQualityDetection.h</key>
		<dict>
			<key>hash2</key>
			<data>
			oNpDkJRNjtLS8jZSeXYB/aKRzNQvLXcFPsag7OyytBI=
			</data>
		</dict>
		<key>Headers/VerIDRecognizable.h</key>
		<dict>
			<key>hash2</key>
			<data>
			nie7bqb1lXzQEO9K7Df2zGsBJg2kUN/D43yquQgJMyM=
			</data>
		</dict>
		<key>Modules/VerIDCore.swiftmodule/arm64-apple-ios.abi.json</key>
		<dict>
			<key>hash2</key>
			<data>
			BLKRt9+gupXrZCh2/nVYQJozXATtVQTeezWJKM4WwsI=
			</data>
		</dict>
		<key>Modules/VerIDCore.swiftmodule/arm64-apple-ios.private.swiftinterface</key>
		<dict>
			<key>hash2</key>
			<data>
			yl10B0Sh8PYQ+iHlFykEnYyXOvTVCTphqwb1CIt/d/4=
			</data>
		</dict>
		<key>Modules/VerIDCore.swiftmodule/arm64-apple-ios.swiftdoc</key>
		<dict>
			<key>hash2</key>
			<data>
			kEQIWgt0A/IGBHlDncmBgFF+GHCJnZ6qiDyMkhEkq6k=
			</data>
		</dict>
		<key>Modules/VerIDCore.swiftmodule/arm64-apple-ios.swiftinterface</key>
		<dict>
			<key>hash2</key>
			<data>
			yl10B0Sh8PYQ+iHlFykEnYyXOvTVCTphqwb1CIt/d/4=
			</data>
		</dict>
		<key>Modules/VerIDCore.swiftmodule/arm64-apple-ios.swiftmodule</key>
		<dict>
			<key>hash2</key>
			<data>
			oQA2LXaGyYcrvwqpXT1vkV2+oeJbgx7sH1JbGj7TCLk=
			</data>
		</dict>
		<key>Modules/module.modulemap</key>
		<dict>
			<key>hash2</key>
			<data>
			Ml7050QZvQvYKCuvzik/qE0EZlQmToVwpN1grMOy8PE=
			</data>
		</dict>
		<key>MoirePatternDetection.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			pyYdDJpGBWlCwRoT8TeogBXBdLTIggiNKsRL9A2HlBw=
			</data>
		</dict>
		<key>MoirePatternDetection.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			eH99HEHBZBaBQpgsaROdEYRyoe5qV4t+bkS6K51aU2Q=
			</data>
		</dict>
		<key>MoirePatternDetection.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			mUrNe7l0WQdXNvoGml0KKyR9JkkhDClRC9tQPYTr914=
			</data>
		</dict>
		<key>MoirePatternDetection.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			cAUadLuLPqetYRKMVtcQEUX7hMrr0Bg51vuDrtaMCck=
			</data>
		</dict>
		<key>MoirePatternDetection.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			flyTZ2q9AlrvPmlYdVZYoV09ePwr1bLC70zGKZxWMRI=
			</data>
		</dict>
		<key>MoirePatternDetection.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			C1BMAMr+fVVL+G9ogYDVpJUP02DwyGiJG7EmFXaNxjQ=
			</data>
		</dict>
		<key>MoirePatternDetection.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			9aX9QtFqIDAnmO9u0wmXm0MAPSMg2fDo6pgxqSdZ+0s=
			</data>
		</dict>
		<key>MoirePatternDetection.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			WTG9U2xFUClKISxvyNPBvuddqBeYC6C2cchgPa+zYjg=
			</data>
		</dict>
		<key>Resources.plist</key>
		<dict>
			<key>hash2</key>
			<data>
			8FmoACtFRkrrLSyWw3CmBu08je7OjSKSBSl3oKWHaTs=
			</data>
		</dict>
		<key>SpoofDetector.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			IkJ2CglpQE4JYtd454PYX441w2jDXyP+aHaF8tIFaxI=
			</data>
		</dict>
		<key>SpoofDetector.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			3vIPDutEK7sXFldLel8uTqhqMOgskoo9PaJmwcOwfgk=
			</data>
		</dict>
		<key>SpoofDetector.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			ED7nf8T8pTzeUFhjjpz1cAdMp1I+SqpIkxL0i9uRQI4=
			</data>
		</dict>
		<key>SpoofDetector.mlmodelc/model0/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			dLsKY2ZBypAU33q+QhjMfJb+C9sGCYqiIXgNLpRmXC0=
			</data>
		</dict>
		<key>SpoofDetector.mlmodelc/model0/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			pwBavkHpTqvINL0HN3JJEWmE3ayxjREZFvIn0fR4nuo=
			</data>
		</dict>
		<key>SpoofDetector.mlmodelc/model0/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			oN8Bj1zyMeFSJyKbYr86TdEsprWG6lZeMi+ttu6xr7E=
			</data>
		</dict>
		<key>SpoofDetector.mlmodelc/model0/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			YOsZuujlQqTjOY+SV5fQMFAWeoMaUTwtb1bb07exbbY=
			</data>
		</dict>
		<key>SpoofDetector.mlmodelc/model0/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			RAilC4/B8551QeVqCvxz+XT08kdo002827hsdusUS2k=
			</data>
		</dict>
		<key>SpoofDetector.mlmodelc/model0/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			JsMfzXP3J1PCXEF2nqub8rHW9vXpXkr2ag9c2kxRcE8=
			</data>
		</dict>
		<key>SpoofDetector.mlmodelc/model0/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			WTG9U2xFUClKISxvyNPBvuddqBeYC6C2cchgPa+zYjg=
			</data>
		</dict>
		<key>SpoofDetector.mlmodelc/model1/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			hTvvOjtqogPPa00fF6apOndQJmHbr1ru5/hYTW7tOUk=
			</data>
		</dict>
		<key>VerIDModel.momd/VerIDModel.mom</key>
		<dict>
			<key>hash2</key>
			<data>
			d3quzkuYEUb41EJwjR5XVxbJXokr91VwWmtD0dax7HU=
			</data>
		</dict>
		<key>VerIDModel.momd/VerIDModel.omo</key>
		<dict>
			<key>hash2</key>
			<data>
			FC3wL4uXfyAmIWXcT3199UgjMAtA1XDhHxq7CgHW4Q8=
			</data>
		</dict>
		<key>VerIDModel.momd/VersionInfo.plist</key>
		<dict>
			<key>hash2</key>
			<data>
			Kf2lM2Qb7gd6R8T6BRsIxu/VbE9GQDiCJXDx0sELom8=
			</data>
		</dict>
		<key>VerIDModels/.gitattributes</key>
		<dict>
			<key>hash2</key>
			<data>
			KNFgdzw7qFVozlak2Rm0Rp7OOQVirzEt1nz2fLccS5E=
			</data>
		</dict>
		<key>VerIDModels/RFB-320.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			TyVUQmk06WI/DiXAglw6FOgHJ3vf+6itaapIgak1v0c=
			</data>
		</dict>
		<key>VerIDModels/RFB-320.nv</key>
		<dict>
			<key>hash2</key>
			<data>
			Eb9fBDDuadRqUBu1r+eBKwtBiKmuzEKPv0QpvB+j1F0=
			</data>
		</dict>
		<key>VerIDModels/RFB-320.param</key>
		<dict>
			<key>hash2</key>
			<data>
			+94guplrxUnrnt23qBcgkpk0zoezZimBxI7hQu2b7mI=
			</data>
		</dict>
		<key>VerIDModels/dlib_face_recognition_resnet_model_v1.dat</key>
		<dict>
			<key>hash2</key>
			<data>
			b4F95U7Stn5zY7j66erXrgqybgArcf2JQblWuWQwpp0=
			</data>
		</dict>
		<key>VerIDModels/facemask-20200720-dut23td+1700-251149%3000.nv</key>
		<dict>
			<key>hash2</key>
			<data>
			Ol6DQlT52gJAZQllGoUUgV+FfYfeZvAsDkgt5RG18V0=
			</data>
		</dict>
		<key>VerIDModels/facenet-20170512.nv</key>
		<dict>
			<key>hash2</key>
			<data>
			TNszQNUOCkIyZUTBc8M1ORXeleg/CbBPBZ7qURHi57o=
			</data>
		</dict>
		<key>VerIDModels/fhogcascade_face_frontal.dat</key>
		<dict>
			<key>hash2</key>
			<data>
			H5gKyHS0B7dUCZF4wrIK9BTohRIAysy8+Rlg+BNf6t0=
			</data>
		</dict>
		<key>VerIDModels/mmod_human_face_detector.dat</key>
		<dict>
			<key>hash2</key>
			<data>
			vkZ7Gnb0gmk947D2of+R0JIxm+cVI9TUsGKPalP8uHo=
			</data>
		</dict>
		<key>VerIDModels/mobilefacenet-opt.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			2LX7YUlDnbBmee6etkKzYsKn0hk0D4J77+h9QIXQvz0=
			</data>
		</dict>
		<key>VerIDModels/mobilefacenet-opt.param</key>
		<dict>
			<key>hash2</key>
			<data>
			t+EnoNJ8orUnv7qF0Rv2yaLJ07Hig1XlepjYWAmsteI=
			</data>
		</dict>
		<key>VerIDModels/mobilefacenet-q12.nv</key>
		<dict>
			<key>hash2</key>
			<data>
			1eEyixt/OZXNX2SU3XDLAaMyq+5F/THy5uxlHizdVjc=
			</data>
		</dict>
		<key>VerIDModels/rec21-recfull-20211108vw-fn23i-s8597c-b144f6-c1062-t100m10-r14s3000-q06.nv</key>
		<dict>
			<key>hash2</key>
			<data>
			sB+oVQ5qGl+ea23QsDWsUHGUKbyrYX2vq1x3bzpsRF0=
			</data>
		</dict>
		<key>VerIDModels/shape_predictor_5_face_landmarks.dat</key>
		<dict>
			<key>hash2</key>
			<data>
			xLHpgEeScH06QFwsFqgKICaeZnUCH2SkHTD/+vvEGIg=
			</data>
		</dict>
		<key>VerIDModels/shape_predictor_68_face_landmarks.dat</key>
		<dict>
			<key>hash2</key>
			<data>
			CpvI7YCkClwGtFbC2eEkRALY2UCyNWbPrxpoV4H/Y9M=
			</data>
		</dict>
	</dict>
	<key>rules</key>
	<dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^version.plist$</key>
		<true/>
	</dict>
	<key>rules2</key>
	<dict>
		<key>.*\.dSYM($|/)</key>
		<dict>
			<key>weight</key>
			<real>11</real>
		</dict>
		<key>^(.*/)?\.DS_Store$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>2000</real>
		</dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^Info\.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^PkgInfo$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^embedded\.provisionprofile$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^version\.plist$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
	</dict>
</dict>
</plist>
