{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "axis_h" : 2,
      "axis_w" : 1,
      "bottom" : "input_1",
      "axis_k" : 0,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "transpose_27",
      "top" : "transpose_27",
      "type" : "transpose",
      "name" : "transpose_27"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "model\/conv2d\/BiasAdd",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model\/conv2d\/Relu",
      "blob_weights" : 3,
      "K" : 1,
      "blob_biases" : 1,
      "name" : "model\/conv2d\/BiasAdd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "transpose_27",
      "weights" : {

      },
      "Nx" : 7,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 7,
      "n_parallel" : 1
    },
    {
      "axis_h" : 2,
      "axis_w" : 1,
      "bottom" : "input_2",
      "axis_k" : 0,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "transpose_26",
      "top" : "transpose_26",
      "type" : "transpose",
      "name" : "transpose_26"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "model\/conv2d_1\/BiasAdd",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model\/conv2d_1\/Relu",
      "blob_weights" : 7,
      "K" : 1,
      "blob_biases" : 5,
      "name" : "model\/conv2d_1\/BiasAdd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "transpose_26",
      "weights" : {

      },
      "Nx" : 7,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 7,
      "n_parallel" : 1
    },
    {
      "axis_h" : 2,
      "axis_w" : 1,
      "bottom" : "input_3",
      "axis_k" : 0,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "transpose_25",
      "top" : "transpose_25",
      "type" : "transpose",
      "name" : "transpose_25"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "model\/conv2d_2\/BiasAdd",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model\/conv2d_2\/Relu",
      "blob_weights" : 11,
      "K" : 1,
      "blob_biases" : 9,
      "name" : "model\/conv2d_2\/BiasAdd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "transpose_25",
      "weights" : {

      },
      "Nx" : 7,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 7,
      "n_parallel" : 1
    },
    {
      "axis_h" : 2,
      "axis_w" : 1,
      "bottom" : "input_4",
      "axis_k" : 0,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "transpose_24",
      "top" : "transpose_24",
      "type" : "transpose",
      "name" : "transpose_24"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "model\/conv2d_3\/BiasAdd",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model\/conv2d_3\/Relu",
      "blob_weights" : 15,
      "K" : 1,
      "blob_biases" : 13,
      "name" : "model\/conv2d_3\/BiasAdd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "transpose_24",
      "weights" : {

      },
      "Nx" : 7,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 7,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "debug_info" : "max_pool_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "max_pool_0",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "max_pool_0",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "model\/conv2d\/Relu",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "debug_info" : "max_pool_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "max_pool_1",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "max_pool_1",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "model\/conv2d_1\/Relu",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "debug_info" : "max_pool_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "max_pool_2",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "max_pool_2",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "model\/conv2d_2\/Relu",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "debug_info" : "max_pool_3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "max_pool_3",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "max_pool_3",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "model\/conv2d_3\/Relu",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "bottom" : "max_pool_1,max_pool_2",
      "alpha" : 1,
      "operation" : 23,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model\/maximum\/Maximum",
      "nd_mode" : true,
      "top" : "model\/maximum\/Maximum",
      "type" : "elementwise",
      "name" : "model\/maximum\/Maximum",
      "beta" : 0
    },
    {
      "bottom" : "model\/maximum\/Maximum,max_pool_3",
      "alpha" : 1,
      "operation" : 23,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model\/maximum\/Maximum_1",
      "nd_mode" : true,
      "top" : "model\/maximum\/Maximum_1",
      "type" : "elementwise",
      "name" : "model\/maximum\/Maximum_1",
      "beta" : 0
    },
    {
      "bottom" : "max_pool_0,model\/maximum\/Maximum_1",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "model\/multiply\/mul",
      "nd_mode" : true,
      "top" : "model\/multiply\/mul",
      "type" : "elementwise",
      "name" : "model\/multiply\/mul",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "model\/conv2d_4\/BiasAdd",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model\/conv2d_4\/Relu",
      "blob_weights" : 19,
      "K" : 32,
      "blob_biases" : 17,
      "name" : "model\/conv2d_4\/BiasAdd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "model\/multiply\/mul",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "debug_info" : "max_pool_4",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 4,
      "top" : "max_pool_4",
      "top_shape_style" : 0,
      "stride_x" : 4,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "max_pool_4",
      "pad_t" : 0,
      "stride_y" : 4,
      "bottom" : "model\/conv2d_4\/Relu",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 4,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "model\/conv2d_5\/BiasAdd",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model\/conv2d_5\/Relu",
      "blob_weights" : 23,
      "K" : 16,
      "blob_biases" : 21,
      "name" : "model\/conv2d_5\/BiasAdd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "max_pool_4",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "debug_info" : "max_pool_5",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "max_pool_5",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "max_pool_5",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "model\/conv2d_5\/Relu",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "model\/conv2d_6\/BiasAdd",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model\/conv2d_6\/Relu",
      "blob_weights" : 27,
      "K" : 32,
      "blob_biases" : 25,
      "name" : "model\/conv2d_6\/BiasAdd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "max_pool_5",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "debug_info" : "max_pool_6",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "max_pool_6",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "max_pool_6",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "model\/conv2d_6\/Relu",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "axis_h" : 0,
      "axis_w" : 2,
      "bottom" : "max_pool_6",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "transpose_23",
      "top" : "transpose_23",
      "type" : "transpose",
      "name" : "transpose_23"
    },
    {
      "name" : "model\/flatten\/Reshape",
      "weights" : {

      },
      "dst_w" : 5280,
      "version" : 1,
      "dst_n" : 1,
      "dst_nd_rank" : 2,
      "type" : "reshape",
      "dst_h" : -1,
      "mode" : 0,
      "dynamic_shape" : false,
      "bottom" : "transpose_23",
      "debug_info" : "model\/flatten\/Reshape",
      "dst_seq" : 1,
      "dst_k" : 1,
      "top" : "model\/flatten\/Reshape"
    },
    {
      "nB" : 5280,
      "top" : "model\/dense\/Relu",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 32,
      "blob_weights" : 31,
      "type" : "inner_product",
      "has_relu" : 1,
      "bottom" : "model\/flatten\/Reshape",
      "blob_biases" : 29,
      "has_tanh" : 0,
      "debug_info" : "model\/dense\/BiasAdd",
      "name" : "model\/dense\/BiasAdd",
      "has_prelu" : 0
    },
    {
      "nB" : 32,
      "top" : "model\/dense_1\/BiasAdd",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 2,
      "blob_weights" : 35,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "model\/dense\/Relu",
      "blob_biases" : 33,
      "has_tanh" : 0,
      "debug_info" : "model\/dense_1\/BiasAdd",
      "name" : "model\/dense_1\/BiasAdd",
      "has_prelu" : 0
    },
    {
      "bottom" : "model\/dense_1\/BiasAdd",
      "weights" : {

      },
      "nd_axis" : -1,
      "debug_info" : "model\/dense_1\/Softmax",
      "top" : "Identity",
      "type" : "softmax_nd",
      "name" : "model\/dense_1\/Softmax",
      "attributes" : {
        "is_output" : 1
      }
    }
  ]
}